inxware/ert-components/target/Component-HAL/adc_dac/ESP32S3_IDF/target_adcdac.c
/***************************************************************
 * Copyright (C) 2008-2022 inx limited, UK - All Rights Reserved
 * You may use, distribute and modify this code under the terms
 * of the LGPLv3 license. You should have received a copy of the
 * LGPLv3 (GNU LESSER GENERAL PUBLIC LICENSE Version 3) license with this file. If
 * not, please visit
 *	<https://www.gnu.org/licenses/lgpl-3.0.txt>
 ***************************************************************/

#include <stdio.h>
#include <time.h>
/* Needed for sqrt */
#include "math.h"

#ifdef USE_ESP32S3_LEGACY_API
#include "driver/adc.h"
#else
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_continuous.h"
#endif

#include "driver/sdm.h"

#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"

#include "esp_err.h"
#include "esp_check.h"


#include "globals.h"
#include "target_adcdac.h"

#define TAG "ESP32"

ehs_adc_config_t g_ehs_adc_configs[EHS_TARGET_ADC_UNIT_NUMBER] = EHS_DEFAULT_ADC_CONFIG();

ehs_uint16 g_ehs_adc_continuous_enabled_bitmask[EHS_TARGET_ADC_UNIT_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(0);

static int32_t adc_conv_results[EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_CHANNEL_DEFAULT(0);
static bool adc_conv_continuous[EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_CHANNEL_DEFAULT(false);

static ehs_sint64 adc_conv_data_mean_accum[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(0));
static ehs_sint64 adc_conv_data_variance_accum[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(0));
static ehs_sint32 adc_conv_data_mean_result[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(0));
static int32_t adc_conv_num_samples[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(1));
static int64_t adc_conv_data_accum[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(0));
static int32_t adc_conv_count[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(0));
static int32_t adc_conv_bias[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(0));

static DRAM_ATTR adc_cali_handle_t adc1_cali_chan_handle[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(NULL));
static bool do_calibration_chan[EHS_TARGET_ADC_UNIT_NUMBER][EHS_TARGET_ADC_CHANNEL_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(EHS_TARGET_ADC_CHANNEL_DEFAULT(false));

static adc_oneshot_unit_handle_t adc1_oneshot_handle[EHS_TARGET_ADC_UNIT_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(NULL);
static adc_continuous_handle_t adc1_continuous_handle[EHS_TARGET_ADC_UNIT_NUMBER] = EHS_TARGET_ADC_UNIT_DEFAULT(NULL);

/***************************** ADC START *****************************/
#ifdef USE_ESP32S3_LEGACY_API
/*
any globals needs for the esp ADC to work.
esp_specific_thing x;
*/
// static const adc_channel_t channel = ADC_CHANNEL_6;     //GPIO34 if ADC1,
// GPIO14 if ADC2 static const adc_bits_width_t width = ADC_WIDTH_BIT_12; static
// const adc_atten_t atten = ADC_ATTEN_DB_0;

ehs_uint8 unit = 0;

static ehs_bool set_ADC_unit(ehs_uint8 value)
{
    switch (value)
    {
    case 1:
        unit = ADC_UNIT_1;
        break;
    case 2:
        unit = ADC_UNIT_2;
        break;
    case 3:
        unit = ADC_UNIT_BOTH;
        break;
    case 7:
        unit = ADC_UNIT_ALTER;
        break;
    default:
        unit = ADC_UNIT_1;
        break;
    }
    return EHS_TRUE;
}

static ehs_bool set_ADC_width(ehs_uint8 width)
{
    adc1_config_width(width);
    return EHS_TRUE;
}

static ehs_bool get_ADC_width(ehs_uint8 *width)
{
    *width = ADC_WIDTH_BIT_12;
    return EHS_TRUE;
}

static ehs_bool set_atten(ehs_uint8 channel, ehs_uint8 atten)
{
    adc1_config_channel_atten(channel, atten);
    return EHS_TRUE;
}

// For ADC1, configure desired precision and attenuation by calling functions
static ehs_bool configure_ADC1(ehs_uint8 channel)
{
    set_ADC_width(ADC_WIDTH_BIT_12);
    set_atten(channel, ADC_ATTEN_DB_0);
    return EHS_TRUE;
}

// Configure the ADC2 channel, including setting attenuation.
static ehs_bool configure_ADC2(ehs_uint8 channel)
{
    adc2_config_channel_atten(channel, ADC_ATTEN_DB_0);
    return EHS_TRUE;
}
#else
#define USE_ESP32S3_ADC_CALIBRATION 1
// implementation for adc version from 5.x
// @todo - implement support for ADC2

#if USE_ESP32S3_ADC_CALIBRATION == 1
/*---------------------------------------------------------------
        ADC Calibration
---------------------------------------------------------------*/

/* ------------------------ Context Structure--------------------------- */
typedef struct adc_cali_scheme_t adc_cali_scheme_t;

/**
 * @brief ADC Calibration Scheme Interface and Context
 */
struct adc_cali_scheme_t {

    /**
     * @brief Convert ADC raw data to calibrated voltage
     *
     * @param[in]  arg        ///< ADC calibration scheme specific context
     * @param[in]  raw        ///< ADC raw data
     * @param[out] voltage    ///< Calibrated ADC voltage (in mV)
     *
     * @return
     *         - ESP_OK:                On success
     *         - ESP_ERR_INVALID_ARG:   Invalid argument
     *         - ESP_ERR_INVALID_STATE: Invalid state, scheme didn't registered
     */
    esp_err_t (*raw_to_voltage)(void *arg, int raw, int *voltage);

    /**
     * @brief ADC calibration specific contexts
     * Can be customized to difference calibration schemes
     */
    void *ctx;

};

typedef struct {
    uint32_t coeff_a;    ///< Gradient of ADC-Voltage curve
    uint32_t coeff_b;    ///< Offset of ADC-Voltage curve
} cali_chars_first_step_t;

typedef struct {
    uint8_t  term_num;                                        ///< Term number of the algorithm formula
    const uint64_t (*coeff)[2];    ///< Coeff of each term. See `adc_error_coef_atten` for details (and the magic number 2)
    const int32_t (*sign);         ///< Sign of each term
} cali_chars_second_step_t;

