inxware/ert-components/target/Component-HAL/adc_dac/ESP32S3_IDF/target_adcdac.c
typedef struct {
    adc_unit_t unit_id;                            ///< ADC unit
    adc_channel_t chan;                            ///< ADC channel
    adc_atten_t atten;                             ///< ADC attenuation
    cali_chars_first_step_t chars_first_step;      ///< Calibration first step characteristics
    cali_chars_second_step_t chars_second_step;    ///< Calibration second step characteristics
} cali_chars_curve_fitting_t;

static int32_t IRAM_ATTR inx_get_reading_error(uint64_t v_cali_1, const cali_chars_second_step_t *param)
{
    if (v_cali_1 == 0 || param->term_num == 0) {
        return 0;
    }

    uint8_t term_num = param->term_num;
    int32_t error = 0;
    uint64_t coeff = 0;
    uint64_t variable[term_num];
    uint64_t term[term_num];

    for (int i = 0; i < term_num; i++) {
        variable[i] = 0;
        term[i] = 0;
    }

    /**
     *  The scheme formula is:
     *  error = (K0 * X^0) + (K1 * X^1)  + (K2 * X^2) + (K3 * X^3) + ... +  (Kn * X^n);
     */
    variable[0] = 1<<10;
    coeff = (param->coeff)[0][0] >> 10;
    term[0] = (variable[0] * coeff) / ((param->coeff)[0][1] >> 10);
    error = (int32_t)term[0] * (param->sign)[0];

    for (int i = 1; i < term_num; i++) {
        variable[i] = (variable[i - 1] * v_cali_1) >> 10;
        coeff = (param->coeff)[i][0] >> 10;
        term[i] = variable[i] * coeff;
        // use 'ets_printf' for logging in ISR
        //ESP_LOGV(TAG, "big coef is %llu, big term%d is %llu, coef_id is %d", coeff, i, term[i], i);

        term[i] = term[i] / ((param->coeff)[i][1] >> 10);
        error += (int32_t)term[i] * (param->sign)[i];
        //ESP_LOGV(TAG, "term%d is %llu, error is %"PRId32, i, term[i], error);
    }

    return error;
}

esp_err_t IRAM_ATTR inx_adc_cali_raw_to_voltage(adc_cali_handle_t handle, int raw, int *voltage)
{
    //pointers are checked in the upper layer
    ESP_RETURN_ON_FALSE_ISR(handle && voltage, ESP_ERR_INVALID_ARG, TAG, "invalid argument: null pointer");
    ESP_RETURN_ON_FALSE_ISR(handle->ctx, ESP_ERR_INVALID_STATE, TAG, "no calibration scheme, create a scheme first");

    cali_chars_curve_fitting_t *ctx = handle->ctx;

#if SOC_ADC_CALIB_CHAN_COMPENS_SUPPORTED
    // make sure this function is IRAM_ATTR !
    int chan_compensation = adc_get_hw_calibration_chan_compens(ctx->unit_id, ctx->chan, ctx->atten);
    raw -= chan_compensation;
    /* Limit the range */
    int max_val = (1L << SOC_ADC_RTC_MAX_BITWIDTH) - 1;
    raw = raw <= 0 ? 0 :
          raw > max_val ? max_val : raw;
#endif  // SOC_ADC_CALIB_CHAN_COMPENS_SUPPORTED

    // v_cali_1 is in fixed point precision (*1024 or <<10). raw is already in 16 bit
    uint64_t v_cali_1 = (((uint64_t)raw * ctx->chars_first_step.coeff_a) >> 6) + (ctx->chars_first_step.coeff_b << 10);
    int32_t error = inx_get_reading_error(v_cali_1, &(ctx->chars_second_step));

    *voltage = (int32_t)v_cali_1 - error;

    return ESP_OK;
}

static bool adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle)
{
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (!calibrated) {
        //ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
        adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if (!calibrated) {
        //ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
        adc_cali_line_fitting_config_t cali_config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif
    *out_handle = handle;
    if (ret == ESP_OK) {
        //ESP_LOGI(TAG, "Calibration Success");
    } else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated) {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    } else {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

    return calibrated;
}

static void adc_calibration_deinit(adc_cali_handle_t handle)
{
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    //ESP_LOGI(TAG, "deregister %s calibration scheme", "Curve Fitting");
    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_cali_delete_scheme_curve_fitting(handle));

#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    //ESP_LOGI(TAG, "deregister %s calibration scheme", "Line Fitting");
    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_cali_delete_scheme_line_fitting(handle));
#endif
}
#endif // USE_ESP32S3_ADC_CALIBRATION

/* one shot adc functions */
static void configure_adc_one_shot(adc_oneshot_unit_handle_t* adc_handle, adc_channel_t channel, const adc_unit_t unit_id, 
                            const adc_bitwidth_t bitwidth, const uint8_t atten)
{
    //-------------ADC Init---------------//
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = unit_id,
    };
    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_new_unit(&init_config, adc_handle));
    adc_oneshot_chan_cfg_t chan_config = {
        .bitwidth = bitwidth,
        .atten = atten,
    };
    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_config_channel(*adc_handle, channel, &chan_config));
   // printf("channel %d bitwidth %d atten %d\n", channel, bitwidth, atten);
}

static ehs_float read_adc_one_shot(adc_oneshot_unit_handle_t* adc_handle, ehs_uint8 channel)
{
    int raw_value = 0;
    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_read(*adc_handle, channel, &raw_value));
#if USE_ESP32S3_ADC_CALIBRATION == 1
    if (do_calibration_chan[0][channel]) {
        int voltage = 0;
        ESP_ERROR_CHECK_WITHOUT_ABORT(inx_adc_cali_raw_to_voltage(adc1_cali_chan_handle[0][channel], raw_value, &voltage));
        return (ehs_float)(voltage + EHS_PID_ADC_CALIBRATION_MAGIC_NUMBER);
    }else{
        return (ehs_float)raw_value;
    }
#else
    return (ehs_float)raw_value;
#endif // USE_ESP32S3_ADC_CALIBRATION
}

static const adc_channel_t DRAM_ATTR adc_channels[EHS_TARGET_ADC_CHANNEL_NUMBER] = {
    ADC_CHANNEL_0,
    ADC_CHANNEL_1,
    ADC_CHANNEL_2,
    ADC_CHANNEL_3,
    ADC_CHANNEL_4,
    ADC_CHANNEL_5,
    ADC_CHANNEL_6,
    ADC_CHANNEL_7,
    ADC_CHANNEL_8,
    ADC_CHANNEL_9
};
