inxware/ert-components/target/Component-HAL/adc_dac/ESP32S3_IDF/target_adcdac.c
static adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = {0};
static bool g_b_adc_init = false;
static bool g_b_adc_configured[SOC_ADC_PATT_LEN_MAX] = {0};
static int g_i_adc_dig_pattern_num = 0;
static bool s_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t* edata, void* user_data); /* IRAM_ATTR on the definition */
/* continuous adc functions */
static void configure_adc_continuous(adc_continuous_handle_t* adc_handle, adc_continuous_callback_t on_conv_done, adc_channel_t channel,
                                     const adc_unit_t unit_id, const adc_bitwidth_t bitwidth, const uint8_t atten)
{
    adc_continuous_handle_cfg_t adc_config = {
        .max_store_buf_size = 256,//1024,
        .conv_frame_size = 64,//256,
    };
    if (*adc_handle == NULL) ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_new_handle(&adc_config, adc_handle));
    if (g_b_adc_init) ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_stop(*adc_handle));

    adc_continuous_config_t dig_cfg = {
        .sample_freq_hz = 1000,
        .conv_mode = ADC_CONV_SINGLE_UNIT_1,
        .format = ADC_DIGI_OUTPUT_FORMAT_TYPE2,
    };

    if (!g_b_adc_configured[channel]) g_i_adc_dig_pattern_num++;
    g_b_adc_configured[channel] = true;
    dig_cfg.pattern_num = g_i_adc_dig_pattern_num;
    // The sampling frequency is divided by the number of active channels
    dig_cfg.sample_freq_hz *= g_i_adc_dig_pattern_num;
    
    adc_pattern[channel].atten = atten;
    adc_pattern[channel].channel = adc_channels[channel] & 0x7;
    adc_pattern[channel].unit = unit_id;
    adc_pattern[channel].bit_width = bitwidth;

    adc_digi_pattern_config_t _adc_pattern[SOC_ADC_PATT_LEN_MAX] = {0};
    int i = 0;
    int j = 0;

    for (; i < SOC_ADC_PATT_LEN_MAX ; i++)
    {
        if (!g_b_adc_configured[i]) continue;
        _adc_pattern[j] = adc_pattern[i];
        j++;
    }

    dig_cfg.adc_pattern = _adc_pattern;
    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_config(*adc_handle, &dig_cfg));

    if (!g_b_adc_init)
    {
        adc_continuous_evt_cbs_t cbs = {
            .on_conv_done = on_conv_done,
        };
        ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_register_event_callbacks(*adc_handle, &cbs, NULL));
    }
    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_start(*adc_handle));
    g_b_adc_init = true;
}
// @TODO - fix continuous option
static ehs_float EhsTGetAdcValue(ehs_uint8 channel)
{
    return sqrt((ehs_float)(adc_conv_results[channel]));
}
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
static TaskHandle_t s_task_handle;
static bool IRAM_ATTR s_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t* edata, void* user_data)
{
    BaseType_t mustYield = pdFALSE;
    //Notify that ADC continuous driver has done enough number of conversions
    // vTaskNotifyGiveFromISR(s_task_handle, &mustYield);

    for (int i = 0 ; i < edata->size ; i += SOC_ADC_DIGI_RESULT_BYTES)
    {
        // Loop through all continuous data stored in a buffer
        adc_digi_output_data_t* p = (void *) &(edata->conv_frame_buffer[i]);
        uint32_t chan_num = p->type2.channel;
        if (chan_num >= EHS_TARGET_ADC_CHANNEL_NUMBER) continue;
        uint32_t data = p->type2.data;
        int cali_data = 0; /* inx_adc_cali_raw_to_voltage writes an int */
        if (adc1_cali_chan_handle[0][chan_num] != NULL)
        {
            inx_adc_cali_raw_to_voltage(adc1_cali_chan_handle[0][chan_num], data, &cali_data);
        }
        adc_conv_data_accum[0][chan_num] += ((((int32_t)cali_data - adc_conv_bias[0][chan_num]) / 1024) * (((int32_t)cali_data - adc_conv_bias[0][chan_num]) / 1024));
        adc_conv_count[0][chan_num] += 1;
        if (adc_conv_count[0][chan_num] == adc_conv_num_samples[0][chan_num])
        {
            adc_conv_results[chan_num] = adc_conv_data_accum[0][chan_num] / adc_conv_count[0][chan_num];
            adc_conv_data_accum[0][chan_num] = 0;
            adc_conv_count[0][chan_num] = 0;
        }
    }
    
    return (mustYield == pdTRUE);
}

#endif

// todo - what is the *config needed for in generic code?
EHS_GLOBAL ehs_bool legacy_configure_adc(ehs_uint8 channel, ehs_bool continuous, ehs_float f_s, ehs_sint32 num_samples, ehs_float bias, ehs_uint8 configure, ehs_uint8 *config)
{
#ifdef USE_ESP32S3_LEGACY_API
    set_ADC_unit(configure);
    if (unit == ADC_UNIT_1)
    {
        configure_ADC1(channel);
        *config = ADC1;
    }
    else
    {
        ehs_uint8 raw;
        configure_ADC2(channel);
        *config = ADC2;
    }
#else
    //s_task_handle = xTaskGetCurrentTaskHandle();
    //-------------ADC1 Config---------------//
    /*
     * ADC_ATTEN_DB_0   - 0dB attenuaton    (0 mV ~ 950 mV)
     * ADC_ATTEN_DB_2_5 - 2.5dB attenuation (0 mV ~ 1250 mV)
     * ADC_ATTEN_DB_6   - 6dB attenuation   (0 mV ~ 1750 mV)
     * ADC_ATTEN_DB_11  - 11dB attenuation  (0 mV ~ 3100 mV)
     */
    if (channel >= EHS_TARGET_ADC_CHANNEL_NUMBER) return EHS_FALSE;
    /* This deprecated path indexes adc1_oneshot_handle/adc1_continuous_handle - which are
     * sized by ADC unit, not by channel - with the channel number. Refuse rather than write
     * past them; use adc_config/adc_read_continuous for channels beyond the unit count. */
    if (channel >= EHS_TARGET_ADC_UNIT_NUMBER) return EHS_FALSE;
    const uint8_t atten = ADC_ATTEN_DB_6;
    const adc_bitwidth_t bitwidth = ADC_BITWIDTH_12;
    adc_conv_num_samples[0][channel] = num_samples;
    adc_conv_bias[0][channel] = (int32_t)(bias * 1024);
    adc_conv_continuous[channel] = continuous;
    // if(continuous == EHS_FALSE){
    //     configure_adc_one_shot(&adc1_oneshot_handle[channel], adc_channels[channel], ADC_UNIT_1, ADC_BITWIDTH_12, ADC_ATTEN_DB_6);
    // }else{
    configure_adc_continuous(&adc1_continuous_handle[channel], s_conv_done_cb, adc_channels[channel], ADC_UNIT_1, ADC_BITWIDTH_12, ADC_ATTEN_DB_6);
    // }
#if USE_ESP32S3_ADC_CALIBRATION == 1
    //-------------ADC1 Calibration Init---------------//
    do_calibration_chan[0][channel] = adc_calibration_init(ADC_UNIT_1, channel, atten, &adc1_cali_chan_handle[0][channel]);
#endif // USE_ESP32S3_ADC_CALIBRATION

#endif
    return EHS_TRUE;
}

