inxware/ert-components/target/Component-HAL/adc_dac/ESP32S3_IDF/target_adcdac.c
EHS_GLOBAL ehs_bool legacy_target_read_adc_sample(ehs_uint8 channel, ehs_float *value, ehs_uint8 config)
{
    if (channel >= EHS_TARGET_ADC_CHANNEL_NUMBER) return EHS_FALSE;
#ifdef USE_ESP32S3_LEGACY_API
    /// todo2022 write the esp32 specific code to get a value and return and error
    /// status.
    ehs_uint8 width;
    // set_ADC_unit(unit);
    if (config == 1)
    {
        *value = adc1_get_raw(channel);
    }
    else
    {
        ehs_uint8 raw;
        get_ADC_width(&width);
        // Take an ADC2 reading on a single channel.
        adc2_get_raw(channel, width, &raw);
        *value = raw;
    }
#else
    // if (adc_conv_continuous[channel])
    // {
    *value = EhsTGetAdcValue(channel);
    // }
    // else
    // {
    //     if(adc1_oneshot_handle[channel] != NULL){
    //         *value = read_adc_one_shot(&adc1_oneshot_handle[channel], channel);
    //     }else{
    //         *value = 0.0f;
    //     }
    // }
#endif
    return EHS_TRUE;
}

ehs_bool legacy_destroy_adc(ehs_uint8 channel)
{
    /* Same unit-sized-array-indexed-by-channel hazard as legacy_configure_adc. */
    if (channel >= EHS_TARGET_ADC_UNIT_NUMBER) return EHS_FALSE;
#ifdef USE_ESP32S3_LEGACY_API
    // not applying
#else
    if(adc1_oneshot_handle[channel] != NULL){
        ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_del_unit(adc1_oneshot_handle[channel]));
        adc1_oneshot_handle[channel] = NULL;
    }
    if(adc1_continuous_handle[channel] != NULL){
        ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_stop(adc1_continuous_handle[channel]));
        ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_deinit(adc1_continuous_handle[channel]));
        adc1_continuous_handle[channel] = NULL;
    }
#if USE_ESP32S3_ADC_CALIBRATION == 1
    if (adc1_cali_chan_handle[0][channel] != NULL) {
        adc_calibration_deinit(adc1_cali_chan_handle[0][channel]);
        adc1_cali_chan_handle[0][channel] = NULL;
    }
    do_calibration_chan[0][channel] = false;
#endif // USE_ESP32S3_ADC_CALIBRATION

#endif
    return EHS_TRUE;
}

#ifdef EHS_PERIPHERALS_ADC_CONTINUOUS_SUPPORT

static bool IRAM_ATTR ehs_s_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data)
{
    BaseType_t mustYield = pdFALSE;
    //Notify that ADC continuous driver has done enough number of conversions
    // vTaskNotifyGiveFromISR(s_task_handle, &mustYield);

    for (int i = 0 ; i < edata->size ; i += SOC_ADC_DIGI_RESULT_BYTES)
    {
        // Loop through all continuous data stored in a buffer
        adc_digi_output_data_t* p = (void *) &(edata->conv_frame_buffer[i]);
        uint32_t unit = p->type2.unit;
        uint32_t chan_num = p->type2.channel;
        if (unit >= EHS_TARGET_ADC_UNIT_NUMBER) continue;
        if (chan_num >= EHS_TARGET_ADC_CHANNEL_NUMBER) continue;
        if (!EHS_IS_BIT_N_SET(g_ehs_adc_continuous_enabled_bitmask[unit], chan_num)) continue;
        uint32_t data = p->type2.data;
#if USE_ESP32S3_ADC_CALIBRATION == 1
        int cali_data = 0; /* inx_adc_cali_raw_to_voltage writes an int */
        if (adc1_cali_chan_handle[unit][chan_num] != NULL)
        {
            inx_adc_cali_raw_to_voltage(adc1_cali_chan_handle[unit][chan_num], data, &cali_data);
        }
        data = cali_data;
#endif // USE_ESP32S3_ADC_CALIBRATION
        uint32_t decimate_average = g_ehs_adc_configs[unit].channel_configs[chan_num].decimate_average >= g_ehs_adc_configs[unit].channel_configs[chan_num].decimation ? g_ehs_adc_configs[unit].channel_configs[chan_num].decimation : g_ehs_adc_configs[unit].channel_configs[chan_num].decimate_average;
        /* Config error - do nothing at all for this channel. A zero decimation divides by
         * zero below, and makes the count test true on every conversion, which would run
         * the FB callback queue from ISR context at the full sample rate. */
        if ((g_ehs_adc_configs[unit].channel_configs[chan_num].decimation == 0u) || (decimate_average == 0u))
        {
            continue;
        }
        if (adc_conv_count[unit][chan_num]++ >= g_ehs_adc_configs[unit].channel_configs[chan_num].decimation - decimate_average)
        {
            adc_conv_data_accum[unit][chan_num] += (((int64_t)((int32_t)data - g_ehs_adc_configs[unit].channel_configs[chan_num].bias) / 1024) * (((int32_t)data - g_ehs_adc_configs[unit].channel_configs[chan_num].bias) / 1024));
            // TODO Double type-casting is used to temporarily unblock hardware testing
            adc_conv_data_mean_accum[unit][chan_num] += (int64_t)((int32_t)data);
            adc_conv_data_variance_accum[unit][chan_num] += (((int64_t)((int32_t)data -  adc_conv_data_mean_result[unit][chan_num]) / 1024) * (((int32_t)data - adc_conv_data_mean_result[unit][chan_num]) / 1024));
        }
        if (adc_conv_count[unit][chan_num] >= g_ehs_adc_configs[unit].channel_configs[chan_num].decimation)
        {
            adc_conv_data_mean_result[unit][chan_num] = adc_conv_data_mean_accum[unit][chan_num] / decimate_average;
            EhsTHAdcChannelContinuousConvertCB(unit, chan_num, (ehs_sint32)(adc_conv_data_mean_result[unit][chan_num]), (ehs_uint32)(adc_conv_data_variance_accum[unit][chan_num] / decimate_average), (ehs_uint32)(adc_conv_data_accum[unit][chan_num] / decimate_average));
            adc_conv_data_accum[unit][chan_num] = 0;
            adc_conv_data_mean_accum[unit][chan_num] = 0;
            adc_conv_data_variance_accum[unit][chan_num] = 0;
            adc_conv_count[unit][chan_num] = 0;
        }
    }

    // Clear the buffer by reading the ring buffer
    adc_continuous_clear_frame_in_ISR(handle, edata->size, &mustYield);

    return (mustYield == pdTRUE);
}

#endif

/* Must match adc_continuous_callback_t exactly - it is called through that pointer type
 * from the ADC ISR. Returns whether a higher-priority task was woken; nothing is woken
 * here, so always false. No logging: this runs in interrupt context. */
static bool IRAM_ATTR ehs_s_pool_ovf_cb(adc_continuous_handle_t handle,
                                        const adc_continuous_evt_data_t *edata,
                                        void *user_data) {
    (void)handle;
    (void)edata;
    (void)user_data;
    return false;
}

ehs_sint32 EhsTAdcUnitConfigure(ehs_uint8 unit)
{
    // Total supported unit count is 2
    if (unit >= EHS_TARGET_ADC_UNIT_NUMBER) return EHS_ADC_ERR_INVALID_DEVICE;
    if (g_ehs_adc_configs[unit].unit_config.init == 1) return EHS_ADC_ERR_ALREADY_INIT;
    switch (g_ehs_adc_configs[unit].unit_config.mode) {
        case 0: // Single-Shot
        {
            // Single Shot Configuration
            adc_oneshot_unit_init_cfg_t init_config = {
                .unit_id = unit
            };
            ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_new_unit(&init_config, &adc1_oneshot_handle[unit]));
            adc_oneshot_chan_cfg_t config = {
                .bitwidth = ADC_BITWIDTH_12,
                .atten = ADC_ATTEN_DB_6,
            };
            for (int i = 0 ; i < EHS_TARGET_ADC_CHANNEL_NUMBER ; i++)
            {
                if (g_ehs_adc_configs[unit].unit_config.channel[i] != -1)
                {
                    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_config_channel(adc1_oneshot_handle[unit], 0, &config));
                #if USE_ESP32S3_ADC_CALIBRATION == 1
                    //-------------ADC1 Calibration Init---------------//
                    do_calibration_chan[unit][i] = adc_calibration_init(unit, i, ADC_ATTEN_DB_6, &adc1_cali_chan_handle[unit][i]);
                #endif // USE_ESP32S3_ADC_CALIBRATION
                }
            }
            break;
        }
        case 1: // Continuous
        {
#ifdef EHS_PERIPHERALS_ADC_CONTINUOUS_SUPPORT
            // Continuous Configuration
            // ADC continuous mode on ADC unit 2 is not available
            if (unit == 1) return EHS_ADC_ERR_HAL_INIT_FAILED;
            int chan_count = 0;
            for (int i = 0 ; i < EHS_TARGET_ADC_CHANNEL_NUMBER ; i++)
            {
                if (g_ehs_adc_configs[unit].unit_config.channel[i] != -1) chan_count++;
            }
            adc_continuous_handle_cfg_t adc_config = {
                .max_store_buf_size = 1024,//1536 * chan_count,
                .conv_frame_size = 32
            };
            ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_new_handle(&adc_config, &adc1_continuous_handle[unit]));
            int adc_count = 0;
            adc_digi_pattern_config_t pattern_adc[SOC_ADC_PATT_LEN_MAX] = {0};
            for (int i = 0 ; i < EHS_TARGET_ADC_CHANNEL_NUMBER ; i++)
            {
                if (g_ehs_adc_configs[unit].unit_config.channel[i] != -1)
                {
                    pattern_adc[adc_count].atten = ADC_ATTEN_DB_6;
                    pattern_adc[adc_count].channel = adc_channels[i] & 0x7;
                    pattern_adc[adc_count].unit = unit;
                    pattern_adc[adc_count].bit_width = ADC_BITWIDTH_12;
                #if USE_ESP32S3_ADC_CALIBRATION == 1
                    //-------------ADC1 Calibration Init---------------//
                    do_calibration_chan[unit][i] = adc_calibration_init(unit, adc_channels[i], ADC_ATTEN_DB_6, &adc1_cali_chan_handle[unit][i]);
                #endif // USE_ESP32S3_ADC_CALIBRATION
                    adc_count++;
                }
            }
            // No ADC channel is enabled
            if (adc_count == 0) return EHS_ADC_ERR_INVALID_CHANNEL;
            adc_continuous_config_t dig_cfg = {
                .sample_freq_hz = g_ehs_adc_configs[unit].unit_config.f_s_hz * adc_count,
                .conv_mode = ADC_CONV_SINGLE_UNIT_1,
                .format = ADC_DIGI_OUTPUT_FORMAT_TYPE2,
                .pattern_num = adc_count,
                .adc_pattern = pattern_adc,
            };
            ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_config(adc1_continuous_handle[unit], &dig_cfg));
            adc_continuous_evt_cbs_t cbs = {
                .on_conv_done = ehs_s_conv_done_cb,
                .on_pool_ovf = ehs_s_pool_ovf_cb
            };
            ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_register_event_callbacks(adc1_continuous_handle[unit], &cbs, NULL));
            ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_start(adc1_continuous_handle[unit]));
#endif
            break;
        }
        default:
            return EHS_ADC_ERR_HAL_INIT_FAILED;
    }
    g_ehs_adc_configs[unit].unit_config.init = 1;
    return EHS_ADC_ERR_NONE;
}

