inxware/ert-components/target/Component-HAL/adc_dac/ESP32S3_IDF/target_adcdac.c
ehs_uint32 EhsTAdcChannelSingleRead(ehs_uint8 unit, ehs_uint8 channel)
{
    // Total supported unit count is 2
    if (unit >= EHS_TARGET_ADC_UNIT_NUMBER) return EHS_FALSE;
    // This ADC unit is not initialised
    if (g_ehs_adc_configs[unit].unit_config.init == 0) return 0;
    // The mode of this ADC is not Single-shot
    if (g_ehs_adc_configs[unit].unit_config.mode != 0) return 0;
    // This ADC channel is not configured
    if (g_ehs_adc_configs[unit].unit_config.channel[channel] == -1) return 0;
    int value = 0; /* adc_oneshot_read writes an int */
    ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_read(adc1_oneshot_handle[unit], channel, &value));
#if USE_ESP32S3_ADC_CALIBRATION == 1
    int cali_value = 0; /* inx_adc_cali_raw_to_voltage writes an int */
    ESP_ERROR_CHECK_WITHOUT_ABORT(inx_adc_cali_raw_to_voltage(adc1_cali_chan_handle[unit][channel], value, &cali_value));
    return cali_value;
#endif // USE_ESP32S3_ADC_CALIBRATION
    return value;
}

ehs_bool EhsTAdcUnitDestroy(ehs_uint8 unit)
{
    ehs_bool bRet = EHS_FALSE;

    // Total supported unit count is 2
    if (unit >= EHS_TARGET_ADC_UNIT_NUMBER) return EHS_FALSE;

    /* Tear down on real resource state, not on unit_config.init: the flag is only set on
     * the success path of configure, so an aborted configure would leave a running
     * conversion that this function then refused to stop. Idempotent - safe to call twice.
     * Stop the ISR seeing this unit before anything is freed. */
    g_ehs_adc_continuous_enabled_bitmask[unit] = 0u;
    /* Stop conversion first: the ISR dereferences the calibration handles freed below. */
    if (adc1_continuous_handle[unit] != NULL)
    {
        ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_stop(adc1_continuous_handle[unit]));
        ESP_ERROR_CHECK_WITHOUT_ABORT(adc_continuous_deinit(adc1_continuous_handle[unit]));
        adc1_continuous_handle[unit] = NULL;
        bRet = EHS_TRUE;
    }
    if (adc1_oneshot_handle[unit] != NULL)
    {
        ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_del_unit(adc1_oneshot_handle[unit]));
        adc1_oneshot_handle[unit] = NULL;
        bRet = EHS_TRUE;
    }
#if USE_ESP32S3_ADC_CALIBRATION == 1
    for (int i = 0 ; i < EHS_TARGET_ADC_CHANNEL_NUMBER ; i++)
    {
        // A non-NULL handle is the only reliable test for "still allocated" - channel[]
        // may have been reconfigured since this handle was created.
        if (adc1_cali_chan_handle[unit][i])
        {
            ESP_ERROR_CHECK_WITHOUT_ABORT(adc_cali_delete_scheme_curve_fitting(adc1_cali_chan_handle[unit][i]));
            adc1_cali_chan_handle[unit][i] = NULL;
            do_calibration_chan[unit][i] = false;
            bRet = EHS_TRUE;
        }
    }
#endif // USE_ESP32S3_ADC_CALIBRATION
    // Clear here rather than relying on the caller, so a second destroy is always a no-op
    g_ehs_adc_configs[unit].unit_config.init = 0;
    return bRet;
}

/***************************** ADC ENDED *****************************/

/***************************** DAC START *****************************/

static sdm_channel_handle_t dac_channel_handles[EHS_TARGET_DAC_NUMBER] = { NULL };
static ehs_sint32 dac_channel_max[EHS_TARGET_DAC_NUMBER] = { 0 };

ehs_bool EhsTDacConfigure(ehs_uint8 channel, ehs_sint32 max, ehs_sint32 sample_rate)
{
    if (channel >= EHS_TARGET_DAC_NUMBER) return EHS_FALSE;
    if (dac_channel_handles[channel] != NULL) return EHS_FALSE;
    if (max <= 0) return EHS_FALSE;
    sdm_config_t config = {
        .clk_src = SDM_CLK_SRC_DEFAULT,
        .gpio_num = channel,
        .sample_rate_hz = sample_rate
    };
    ESP_ERROR_CHECK_WITHOUT_ABORT(sdm_new_channel(&config, &(dac_channel_handles[channel])));
    /* sdm_channel_enable takes the handle, not its address - sdm_new_channel above is the
     * out-param call that needs the '&'. */
    ESP_ERROR_CHECK_WITHOUT_ABORT(sdm_channel_enable(dac_channel_handles[channel]));
    dac_channel_max[channel] = max;
    return EHS_TRUE;
}

ehs_bool EhsTDacSet(ehs_uint8 channel, ehs_sint32 value)
{
    if (channel >= EHS_TARGET_DAC_NUMBER) return EHS_FALSE;
    if (dac_channel_handles[channel] == NULL) return EHS_FALSE;
    ehs_sint32 actual_value = ((value > dac_channel_max[channel] ? dac_channel_max[channel] : value < 0 ? 0 : value) << 8) / dac_channel_max[channel] - 128;
    // printf("DAC set value for channel %d: %d\n", channel, actual_value);
    ESP_ERROR_CHECK_WITHOUT_ABORT(sdm_channel_set_pulse_density(dac_channel_handles[channel], actual_value));
    return EHS_TRUE;
}

ehs_bool EhsTDacDestroy(ehs_uint8 channel)
{
    if (channel >= EHS_TARGET_DAC_NUMBER) return EHS_FALSE;
    if (dac_channel_handles[channel] == NULL) return EHS_FALSE;
    ESP_ERROR_CHECK_WITHOUT_ABORT(sdm_del_channel(dac_channel_handles[channel]));
    dac_channel_handles[channel] = NULL;
    dac_channel_max[channel] = 0;
    return EHS_TRUE;
}

/***************************** DAC ENDED *****************************/
